Revit 2027 API
ContextMenu.AddItem Method
 Add an item to the Context Menu.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddItem(
	MenuItem menuItem
)
Public Sub AddItem (
	menuItem As MenuItem
)
public:
void AddItem(
	MenuItem^ menuItem
)
member AddItem :
        menuItem : MenuItem -> unit
Parameters
menuItem MenuItem
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Use this method to add a specific type of MenuItem object to context menu.
See Also
Reference
ContextMenu Class
Autodesk.Revit.UI Namespace